import os

PI = 3.14159265


def cls():
    os.system('cls' if os.name == 'nt' else 'clear')


menuConfig = [
    "Операции с одним числом",
    "Простейший арифметический калькулятор",
    # "Отдел тригонометрических функций",
    # "Геометрия",
    # "Информация",
    # "Разгрузка мозгов",
    # "Уравнения",
    "Выход из программы"
]

oneNumberExpressionsConfig = [
    "Вычислить квадратный корень",
    "Возвести в n-ую степень",
    "Вычислить факториал",
    "Проверить на простое",
    "Вычислить логарифм",
    "Вернуться назад"
]




