import os

PI = 3.1415926535


def cls():
    os.system('cls' if os.name == 'nt' else 'clear')


menuConfig = [
    "Операции с одним числом",
    "Простейший арифметический калькулятор",
    "Отдел тригонометрических функций",
    # "Геометрия",
    # "Информация",
    # "Разгрузка мозгов",
    # "Уравнения",
    "Выход из программы"
]

oneNumberExpressionsConfig = [
    "Вычислить квадратный корень",
    "Возвести в n-ую степень",
    "Вычислить факториал",
    "Проверить на простое",
    "Вычислить логарифм",
    "Вернуться назад"
]

trigonometryConfig = [
    "Синус",
    "Косинус",
    "Тангенс",
    "Котангенс",
    "Перевод радиан в градусы",
    "Перевод градусов в радианы",
    "Вернуться назад"
]

anglesConfig = {
    "0": {
        "sin": "0",
        "cos": "1",
        "tan": "0",
        "cot": "-",
        "rad": "0"
    },
    "30": {
        "sin": "1/2",
        "cos": "√3/2",
        "tan": "1/√3",
        "cot": "√3",
        "rad": "p/6"
    },
    "45": {
        "sin": "√2/2",
        "cos": "√2/2",
        "tan": "1",
        "cot": "1",
        "rad": "p/4"
    },
    "60": {
        "sin": "√3/2",
        "cos": "1/2",
        "tan": "√3",
        "cot": "1/√3",
        "rad": "p/3"
    },
    "90": {
        "sin": "1",
        "cos": "0",
        "tan": "-",
        "cot": "0",
        "rad": "p/2"
    },
    "180": {
        "sin": "0",
        "cos": "-1",
        "tan": "0",
        "cot": "-",
        "rad": "p"
    },
    "270": {
        "sin": "-1",
        "cos": "0",
        "tan": "-",
        "cot": "0",
        "rad": "3p/2"
    },
    "360": {
        "sin": "0",
        "cos": "1",
        "tan": "0",
        "cot": "-",
        "rad": "2p"
    },
}

